## PROYECTO INDIVIDUAL Nº1

### carga de librerias para realizar el proseso ETL

In [58]:
# importa las bibliotecas pandas y numpy
import pandas as pd
import numpy as np
#import datetime
import json

##### Este fragmento de codigo es para visualizar toda la columna del dataset

In [59]:
pd.set_option("display.max.columns",None)

#### carga de los datos CSV
Se utilizará la función `pandas.read_csv()` para leer el archivo *csv*.

,date_parser=["release_date"],dayfirst=True

In [60]:
df_movie=pd.read_csv("../trabajo_venv/Data_set/movies_dataset.csv",sep=",")

C:\Users\a\AppData\Local\Temp\ipykernel_18568\3410268334.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  df_movie=pd.read_csv("../trabajo_venv/Data_set/movies_dataset.csv",sep=",")

#### visualizando los datos del dataframe

In [61]:
# Para ver como se ven los datos, se utiliza em método head() o sample(te muestra los datos de forma aleatoria)
df_movie.head(2)

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",21.946943,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,17.015539,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,"[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0

#### Mostrando la informacion del dataset

In [62]:
df_movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 24 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   adult                  45466 non-null  object
 1   belongs_to_collection  4494 non-null   object
 2   budget                 45466 non-null  object
 3   genres                 45466 non-null  object
 4   homepage               7782 non-null   object
 5   id                     45466 non-null  object
 6   imdb_id                45449 non-null  object
 7   original_language      45455 non-null  object
 8   original_title         45466 non-null  object
 9   overview               44512 non-null  object
 10  popularity             45461 non-null  object
 11  poster_path            45080 non-null  object
 12  production_companies   45463 non-null  object
 13  production_countries   45463 non-null  object
 14  release_date           45379 non-null  object
 15  revenue                45460 non-null  float64
 16  runtime                45203 non-null  float64
 17  spoken_languages       45460 non-null  object
 18  status                 45379 non-null  object
 19  tagline                20412 non-null  object
 20  title                  45460 non-null  object
 21  video                  45460 non-null  object
 22  vote_average           45460 non-null  float64
 23  vote_count             45460 non-null  float64
dtypes: float64(4), object(20)
memory usage: 8.3+ MB

#### Evaluar los datos faltantes

Los valores que faltan se convierten a un valor predeterminado. Para identificarlos se puede usar ***isna()*** o alguna de las siguientes dos funciones:

1. .isnull()
2. .notnull()

La salida es un valor de verdad que indica si el valor que se le pasa como parámetro es o no un dato faltante.

In [63]:
df_movie.isna().sum()

adult                        0
belongs_to_collection    40972
budget                       0
genres                       0
homepage                 37684
id                           0
imdb_id                     17
original_language           11
original_title               0
overview                   954
popularity                   5
poster_path                386
production_companies         3
production_countries         3
release_date                87
revenue                      6
runtime                    263
spoken_languages             6
status                      87
tagline                  25054
title                        6
video                        6
vote_average                 6
vote_count                   6
dtype: int64

In [64]:
df_movie.shape

(45466, 24)

#### realizando copia del dataset, para no afectar el original

In [65]:
df_copia=df_movie.copy()

##### La funcion _duplicated()_ de pandas devuelve una serie de buleano que denota fila duplicadas.
> <dr>Al establecer _keepen_ Falso, todos los duplicados son Verdaderos.<dr>
> <dr>si en caso ubiera duplicados se pasara a eliminar los duplicados, en este caso si hay duplicados <dr>

In [66]:
df_copia.drop_duplicates(keep="last",inplace=True)

In [67]:
# observamos que ya no tenemos duplicados en la data set
df_copia[df_copia.duplicated(keep=False)]

Empty DataFrame
Columns: [adult, belongs_to_collection, budget, genres, homepage, id, imdb_id, original_language, original_title, overview, popularity, poster_path, production_companies, production_countries, release_date, revenue, runtime, spoken_languages, status, tagline, title, video, vote_average, vote_count]
Index: []

### tranformando los datos

##### 1. Eliminar las columnas que no serán utilizadas, video,imdb_id,adult,original_title,vote_count,poster_path y homepage.

In [68]:
df_copia.drop(columns=["video","imdb_id","adult","original_title","vote_count","poster_path","homepage"], inplace=True, axis=1)

##### 2. Los valores nulos de los campos ***revenue***, ***budget*** deben ser rellenados por el número 0.
- en este caso en la columna ***budget*** no hay valores nulos, por ende no es necesario de remplazar por 0

In [69]:
df_copia["budget"].isna().sum()

0

In [70]:
df_copia["revenue"]=df_copia["revenue"].replace(np.nan,0)
# comprovamos si efectivamente se remplazo los nullos por 0
#df_copia["revenue"].isna().value_counts()

##### 3. Los valores nulos del campo ***release_date*** deben eliminarse.

In [71]:
df_copia.dropna(subset=["release_date"],inplace=True)

In [72]:
df_copia["release_date"].isnull().sum()

0

##### 4. De haber fechas, deberán tener el formato AAAA-mm-dd, además deberán crear la columna release_year donde extraerán el año de la fecha de estreno.
<dr>aplicamos  ***to_datetime()***<dr>

In [73]:

df_copia["release_date"]=pd.to_datetime(df_copia["release_date"],format='%Y-%m-%d',yearfirst=True,errors="ignore")

##### Eliminamos si hay espacios vacios en los extrmos

In [74]:
df_copia["release_date"]=df_copia["release_date"].str.strip()

##### Separamos los datos de la columna ***release_date*** en tres columnas "release_year","mes","dia"

In [75]:
df_copia[["release_year","mes","dia"]]=df_copia["release_date"].str.split("-",expand=True)

##### finalmente eliminamos la columna ***release_date***

In [76]:
df_copia.drop(columns=["release_date"],axis=1,inplace=True)

##### tanbien observamos que hay 3 valores nulos en la columna ***mes***, ***dia*** y finalmente lo eliminamos dichos valores nulos, por que se generaron al expandir la columna release_date

In [77]:
df_copia[["mes","dia"]].isnull().sum()

mes    3
dia    3
dtype: int64

In [78]:
# eliminamos los valores nulos por que mas a delante no nos va a permitir realizar los combios de mes y dia a su respectivo nombres
df_copia.dropna(subset=["mes","dia"],inplace=True)

##### como podemos observar las columnas creadas

In [79]:
df_copia.head(2)

,belongs_to_collection,budget,genres,id,original_language,overview,popularity,production_companies,production_countries,revenue,runtime,spoken_languages,status,tagline,title,vote_average,release_year,mes,dia
0,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",862,en,"Led by Woody, Andy's toys live happily in his ...",21.946943,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'iso_3166_1': 'US', 'name': 'United States o...",373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,7.7,1995,10,30
1,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",8844,en,When siblings Judy and Peter discover an encha...,17.015539,"[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'iso_3166_1': 'US', 'name': 'United States o...",262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,6.9,1995,12,15

##### 5. Cree la columna con el retorno de inversión, llame ***return*** con los campos ***revenue*** y ***budget***, dividiendo estas dos últimas revenue / budget, cuando no haya datos disponibles para calcularlo, deberá tomar el valor 0

##### observamos que hay valor string

In [ ]:
#df_copia.iloc[19704:,[1]]

##### remplazamos esos valores string en 0

In [80]:
df_copia["budget"]=df_copia["budget"].replace("/ff9qCepilowshEtG2GYWwzt2bs4.jpg",0)
df_copia["budget"]=df_copia["budget"].replace("/zV8bHuSL6WXoD6FWogP9j4x80bL.jpg",0)
df_copia["budget"]=df_copia["budget"].replace("/zaSf5OG7V8X8gqFvly88zDdRm46.jpg",0)

##### combertimos el tipo de datos de object a númerico

In [81]:
df_copia["budget"]=pd.to_numeric(df_copia["budget"])
#df_copia["release_year"]=pd.to_numeric(df_copia["release_year"])
df_copia=df_copia.astype({"release_year":int,"mes":int,"dia":int})

#### combertiendo las columnas mes y dia a sus respectivos nombres

In [82]:
# importamos las librerias correspondientes
import locale # se refiere a la hora local
import calendar

# Configurar el idioma en español
locale.setlocale(locale.LC_TIME, 'es_ES.UTF-8')

'es_ES.UTF-8'

In [83]:
# comvertiendo la columna mes a su respectivo nombre
df_copia['mes'] = df_copia['mes'].apply(lambda x: calendar.month_name[x])

In [84]:
import datetime
# Definir una función que convierta el número del día de la semana en su nombre correspondiente
def convertir_dia_semana(numero_dia):
    fecha = datetime.date(2023,5, numero_dia)
    nombre_dia = calendar.day_name[fecha.weekday()]
    return nombre_dia

# Convertir la columna "dia" a su correspondiente nombre de día de la semana
df_copia['dia'] = df_copia['dia'].apply(convertir_dia_semana)

In [85]:
df_copia["dia"].unique()

array(['martes', 'lunes', 'miÃ©rcoles', 'sÃ¡bado', 'domingo', 'jueves',
       'viernes'], dtype=object)

##### cambiando lon nombres de los dias 'miÃ©rcoles', 'sÃ¡bado'

In [86]:
df_copia["dia"]=df_copia["dia"].str.replace("miÃ©rcoles","miercoles")
df_copia["dia"]=df_copia["dia"].str.replace("sÃ¡bado","sabado")

##### creamos una nueva columna ***return*** y lo redondeamos a dos digito y eliminamos los nulos por que eran demaciados

In [87]:
df_copia["return"]=round(df_copia["revenue"]/df_copia["budget"],2)

In [266]:
#df_copia.dropna(subset=["return"],inplace=True)

##### 6. Algunos campos, como ***belongs_to_collection***, ***production_companies*** y otros (ver diccionario de datos) están anidados, esto es o bien tienen un diccionario o una lista como valores en cada fila, ¡deberán desinfectarlos para poder y unirlos al dataset de nuevo hacer alguna de las consultas de la API! O bien buscar la manera de acceder a esos datos sin desinfectarlos.

##### 6.1. primero separamos los datos de tipo json

In [88]:
df_json=df_copia.iloc[:,[0,2,5,7,8,11]]
df_json.head(2)

,belongs_to_collection,genres,overview,production_companies,production_countries,spoken_languages
0,"{'id': 10194, 'name': 'Toy Story Collection', ...","[{'id': 16, 'name': 'Animation'}, {'id': 35, '...","Led by Woody, Andy's toys live happily in his ...","[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_639_1': 'en', 'name': 'English'}]"
1,NaN,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",When siblings Judy and Peter discover an encha...,"[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_639_1': 'en', 'name': 'English'}, {'iso..."

##### 6.1.1 trabajando con la columna belongs_to_collection

In [ ]:
df_json['belongs_to_collection'] = df_json['belongs_to_collection'].str.replace("'",'"')
def safe_json_loads(s):
    try:
        return json.loads(s)
    except:
        return {}

df_json['belongs_to_collection'] = df_json['belongs_to_collection'].fillna('{}')
df_diccionario = pd.json_normalize(df_json['belongs_to_collection'].apply(safe_json_loads))

##### Renombramos la columna name por franquicia

In [90]:
df_diccionario.rename(columns={"name":"franquicia"},inplace=True)

##### Eliminamos las columnas que no deseamos

In [91]:
df_diccionario.drop(columns=["id","poster_path","backdrop_path"],inplace=True,axis=1)

In [92]:
df_franquicias=df_diccionario.dropna()
df_franquicias

                           franquicia
0                Toy Story Collection
2           Grumpy Old Men Collection
4      Father of the Bride Collection
9               James Bond Collection
12                   Balto Collection
...                               ...
45252    Frankenstein (Hammer Series)
45254         The Carry On Collection
45257         The Carry On Collection
45268         The Carry On Collection
45281            Red Lotus Collection

[3165 rows x 1 columns]

##### 6.1.2 trabajando con la columna ***genres***

definimos una función ***safe_json_loads()*** que envuelve la función json.loads()en un bloque try-except para manejar excepciones de manera segura:

In [93]:
def safe_json_loads(json_str):
    try:
        return json.loads(json_str)
    except (json.JSONDecodeError, TypeError):
        return None

In [ ]:
df_json['genres'] = df_json['genres'].str.replace("'", '"')

df_json['genres'] = df_json['genres'].fillna('{}')
df_genero = pd.json_normalize(df_json['genres'].apply(safe_json_loads))

shape = df_genero.shape

lista = []

for i in range(0, shape[1]):
    df_genero[[i]] = df_genero[[i]].astype(str)
    df_genero[i] = df_genero[i].str.replace("'", '"')
    df_genero[i] = df_genero[i].fillna('{}')
    globals()['df_genres{}'.format(i)] = pd.json_normalize(df_genero[i].apply(safe_json_loads)).rename(columns={"id":"Id{}".format(i+1), "name":"name{}".format(i+1)})
    lista.append(globals()['df_genres{}'.format(i)])  

# unimos todos los Dataset de la lista en uno solo
df_genero_final = pd.concat(lista,axis=1)

##### uniendo las columnas 'name1', 'name2', 'name3' ,generado en una sola columna separado por una coma, en la df_genero_final

In [95]:
df_genero_final['new_col'] = df_genero_final[['name1', 'name2', 'name3']].apply(lambda x: ','.join(x.dropna().astype(str)), axis=1)

In [96]:
df_genero_final.rename(columns={"new_col":"genres"},inplace=True)

##### obteniendo la columna unica

In [97]:
df_generos=df_genero_final.iloc[:,[16]].dropna()
df_generos

                         genres
0       Animation,Comedy,Family
1      Adventure,Fantasy,Family
2                Romance,Comedy
3          Comedy,Drama,Romance
4                        Comedy
...                         ...
45358      Drama,Action,Romance
45359                     Drama
45360     Action,Drama,Thriller
45361
45362

[45363 rows x 1 columns]

#### 6.1.3 trabajando con la columna producto company

In [ ]:
df_json['production_companies'] = df_json['production_companies'].str.replace("'", '"')

df_json['production_companies'] = df_json['production_companies'].fillna('{}')
df_producto_compañia = pd.json_normalize(df_json['production_companies'].apply(safe_json_loads))

In [100]:
df_compañia = []

for i in range (0, df_producto_compañia.shape[1]):
    df_producto_compañia[[i]] =df_producto_compañia[[i]].astype(str)
    df_producto_compañia[i] = df_producto_compañia[i].str.replace("'", '"')
    df_producto_compañia[i] = df_producto_compañia[i].fillna('{}')
    globals()['df_producto_compañia{}'.format(i)] = pd.json_normalize(df_producto_compañia[i].apply(safe_json_loads)).astype(str)
    df_compañia.append(globals()['df_producto_compañia{}'.format(i)]) 
df_productor = pd.concat(df_compañia,axis=1)

In [101]:
df_productor.replace("nan","",inplace=True)

In [102]:
df_productor.rename(columns={"name":"production_companies"},inplace=True)

##### obteniendo la columna

In [103]:
df_produc_com=df_productor.iloc[:,[0]].dropna()
df_produc_com

                         production_companies
0                     Pixar Animation Studios
1                            TriStar Pictures
2                                Warner Bros.
3      Twentieth Century Fox Film Corporation
4                       Sandollar Productions
...                                       ...
45358            Westdeutscher Rundfunk (WDR)
45359                             Sine Olivia
45360                 American World Pictures
45361                               Yermoliev
45362

[45363 rows x 1 columns]

##### 6.1.5 trabajando con la columna production_countries

In [ ]:
df_json['production_countries'] = df_json['production_countries'].str.replace("'", '"')

df_json['production_countries'] = df_json['production_countries'].fillna('{}')
df_producto_pais = pd.json_normalize(df_json['production_countries'].apply(safe_json_loads))

In [105]:
df_producto_pais.head(2)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24
0,"{'iso_3166_1': 'US', 'name': 'United States of...",None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None
1,"{'iso_3166_1': 'US', 'name': 'United States of...",None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None,None

In [106]:
df_continente = []

for i in range (0, df_producto_pais.shape[1]):
    df_producto_pais[[i]] =df_producto_pais[[i]].astype(str)
    df_producto_pais[i] = df_producto_pais[i].str.replace("'", '"')
    df_producto_pais[i] = df_producto_pais[i].fillna('{}')
    globals()['df_producto_pais{}'.format(i)] = pd.json_normalize(df_producto_pais[i].apply(safe_json_loads)).astype(str)
    df_continente.append(globals()['df_producto_pais{}'.format(i)]) 
df_pais = pd.concat(df_continente,axis=1)

In [107]:
df_pais.sample(2)

,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name,iso_3166_1,name
7100,US,United States of America,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan
10789,US,United States of America,AU,Australia,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan

In [108]:
df_pais.replace("nan","",inplace=True)
df_pais.rename(columns={"name":"production_countries"},inplace=True)

In [109]:
df_contri=df_pais.iloc[:,[1]].dropna()
df_contri

           production_countries
0      United States of America
1      United States of America
2      United States of America
3      United States of America
4      United States of America
...                         ...
45358                    Canada
45359               Philippines
45360  United States of America
45361                    Russia
45362            United Kingdom

[45363 rows x 1 columns]

##### uniendo la data

In [110]:
df_copia.drop(columns=["belongs_to_collection","genres","production_companies","production_countries","spoken_languages"],inplace=True,axis=1)

In [111]:
df_actualizado=pd.concat([df_copia,df_franquicias,df_generos,df_produc_com,df_contri],axis=1).reindex(df_copia.index)

##### Finalmente guardamos la data

In [112]:
df_copia_01=df_actualizado.to_csv("../trabajo_venv/Data_set/movies_dataset2023_para_EDA.csv",index=False)